replaced raw markdown structures sith mermaid flow diagrams andd removed duplicate files
